PHP 
Hypertext Preprocessor
Мова програмування, початково призначена для покращення можливостей
HTML (змінні, інструкції, вирази, файли/шаблони)
На сьогодні - повноцінна мова програмування, яка частіше за все
використовується для задач бекенду.

За приблизною аналогією з JS, РНР має подвійне розуміння
- частина (модуль) веб-сервера, яка продовжує оброблення запитів
- самостійний продукт для виконання програм

Для встановлення краще за все використати збірку (налаштовані
між собою веб-сервер, РНР, СУБД та інше). Такими є
XAMPP, OpenServer, Danver, ...
                                    сайт 1  (index.php)
веб-запит --> [Apache(веб-сервер)] < .... >  
                                    сайт N  (index.php)
									
веб-сервер приймає запит, розбирає його (виділяє метод, заголовки,
передані форми, файли тощо) та запускає РНР файл у запитаному сайті
Те, що виводить РНР, передається сервером як відповідь на запит.
!! Виведення РНР (як модуля) потрапляє не на "екран", а в тіло HTML

- Тип мови: інтерпретатор (REPL)
- 4GL
- парадигма: процедурна (з підтримкою ООП)
==============================================

Для зручності роботи з кількома проєктами (сайтами) бажано налаштувати
локальний (віртуальний) хостінг.
- папка з конфігурацією Apache (conf/extra/)
- відкриваємо у редакторі httpd-vhosts.conf
- за зразком, наведеним у конфігурації, створюємо запис для нашого сайту
- додаємо імена локальних сайтів до локальної DNS 
  = переходимо до C:\Windows\System32\drivers\etc
  = відкриваємо на редагування (адмін) файл hosts
  = додаємо за зразком
  	127.0.0.1       spd-111.loc
	::1             spd-111.loc
	127.0.0.1       www.spd-111.loc
	::1             www.spd-111.loc
- зупиняємо та запускаємо Apache з панелі XAMPP
- мають з'явитись файли .log у папці логів
- у браузері набираємо http://spd-111.loc  (обовязково з http)